UT_Marketplaces.Marketplaces/src/DataProcessors/рар_мп_ЗагрузкаОтчетаКомиссионера/рар_мп_ЗагрузкаОтчетаКомиссионера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>рар_мп_ЗагрузкаОтчетаКомиссионера</name>
</mdclass:DataProcessor>

UT_Marketplaces.Marketplaces/src/Enums/рар_мп_Маркетплейсы/рар_мп_Маркетплейсы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рар_мп_Маркетплейсы</name>
  <enumValues>
    <name>OZON</name>
  </enumValues>
  <enumValues>
    <name>ЯндексМаркет</name>
  </enumValues>
  <enumValues>
    <name>Wildberries</name>
  </enumValues>
</mdclass:Enum>

UT_Marketplaces.Marketplaces/src/Enums/рар_мп_СхемыРаботы/рар_мп_СхемыРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рар_мп_СхемыРаботы</name>
  <enumValues>
    <name>FBS</name>
  </enumValues>
  <enumValues>
    <name>FBO</name>
  </enumValues>
</mdclass:Enum>

UT_Marketplaces.Marketplaces/src/DataProcessors/рар_мп_ЗагрузкаОтчетаКомиссионера/Forms/Форма/Module.bsl
#Область СлужебныеПроцедурыИФункцииДляПроверкиПЛС

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ПриПовторномОткрытииНаСервере() = Ложь Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Вы не приняли лицензионное соглашение 1С-Рарус, функционал расширения не доступен'");
		Сообщение.Сообщить();
		ЭтотОбъект.Закрыть();
	Иначе
		АккаунтМаркетплейсаПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПриПовторномОткрытииНаСервере()
	Возврат Константы.рар_мп_Согласие.Получить();
КонецФункции

&НаКлиенте
Процедура ПриПовторномОткрытии()
	Если ПриПовторномОткрытииНаСервере() = Ложь Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Вы не приняли лицензионное соглашение 1С-Рарус, функционал расширения не доступен'");
		Сообщение.Сообщить();
		ЭтотОбъект.Закрыть();
	КонецЕсли;
КонецПроцедуры  

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АккаунтМаркетплейсаПриИзменении(Элемент)
	
	ДанныеИзМаркетплейса.Очистить();
	
	ВсегоВыплатыОтПартнеров 	= 0;
	ВсегоНачисленоБаллов 		= 0;
	ВсегоБазоваяКомиссия 		= 0;
	ВсегоКомиссияПослеСкидок 	= 0;
	ВсегоКНачислению 			= 0;
	
	АккаунтМаркетплейсаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура АккаунтМаркетплейсаПриИзмененииНаСервере()
	
	Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АккаунтМаркетплейса, "Маркетплейс");
	
	ОтчетКомиссионера = Документы.ОтчетКомиссионера.ПустаяСсылка();
	
	Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
		
		Элементы.УстановитьИнтервал.Видимость	= Истина;
		Элементы.НачалоПериода.Видимость 		= Истина;
		Элементы.КонецПериода.Видимость 		= Истина;
		
		Элементы.ПредставлениеМесяцГод.Видимость 	= Ложь;
		Элементы.ГруппаСклад.Видимость				= Ложь;
		
		Элементы.ДанныеИзМаркетплейсаАртикул.Видимость				= Истина;
		Элементы.ДанныеИзМаркетплейсаБаракод.Видимость				= Истина;
		Элементы.ДанныеИзМаркетплейсаОбоснованиеДляОплаты.Видимость = Истина;
		Элементы.ДанныеИзМаркетплейсаВознаграждениеБезНДС.Видимость = Истина;
		Элементы.ДанныеИзМаркетплейсаНДССВознаграждения.Видимость	= Истина;
		Элементы.ДанныеИзМаркетплейсаЦена.Видимость					= Истина;
		Элементы.ДанныеИзМаркетплейсаСумма.Видимость				= Истина;
		Элементы.ДанныеИзМаркетплейсаПродано.Видимость				= Истина;
		Элементы.ДанныеИзМаркетплейсаТипДокумента.Видимость			= Истина;
		
		Элементы.ДанныеИзМаркетплейсаВознаграждение.Видимость				= Ложь;
		Элементы.ДанныеИзМаркетплейсаSKU.Видимость							= Ложь;
		Элементы.ДанныеИзМаркетплейсаНомерЗаказа.Видимость					= Ложь;
		Элементы.ДанныеИзМаркетплейсаЦенаЗаШтукуБезУчетаСкидок.Видимость 	= Ложь;
		Элементы.ДанныеИзМаркетплейсаЦенаЗаШтукуСУчетомСкидок.Видимость 	= Ложь;
		Элементы.ДанныеИзМаркетплейсаЦенаСуммаБезУчетаСкидок.Видимость 		= Ложь;
		Элементы.ДанныеИзМаркетплейсаЦенаСуммаСУчетомСкидок.Видимость 		= Ложь;
		Элементы.ДанныеИзМаркетплейсаЦенаПродавцаСУчетомСкидки.Видимость	= Ложь;
		Элементы.ГруппаРеализованоOzon.Видимость							= Ложь;
		Элементы.ГруппаВозвращеноOzon.Видимость								= Ложь;
		Элементы.ГруппаОтправлениеOzon.Видимость							= Ложь;
		Элементы.ГруппаСчетФактура.Видимость								= Ложь;
		Элементы.ГруппаИтогиOzon.Видимость									= Ложь;
		
		МесяцГод = Дата(1,1,1);
		
		ПредставлениеМесяцГод = Формат(МесяцГод, "ДФ='MMMM yyyy'");
		
		Если АккаунтМаркетплейса.СхемаРаботы = Перечисления.рар_мп_СхемыРаботы.FBO Тогда
			Элементы.ДанныеИзМаркетплейсаНомерПоставки.Видимость = Ложь;
		Иначе
			Элементы.ДанныеИзМаркетплейсаНомерПоставки.Видимость = Истина;
		КонецЕсли;
		
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON Тогда
		
		Элементы.ПредставлениеМесяцГод.Видимость = Истина;
		
		Элементы.УстановитьИнтервал.Видимость	= Ложь;
		Элементы.НачалоПериода.Видимость 		= Ложь;
		Элементы.КонецПериода.Видимость 		= Ложь;
		Элементы.ГруппаСклад.Видимость			= Ложь;
		
		Элементы.ДанныеИзМаркетплейсаSKU.Видимость							= Истина;
		Элементы.ГруппаРеализованоOzon.Видимость							= Истина;
		Элементы.ГруппаВозвращеноOzon.Видимость								= Истина;
		Элементы.ГруппаОтправлениеOzon.Видимость							= Истина;
		Элементы.ГруппаСчетФактура.Видимость								= Истина;
		Элементы.ГруппаИтогиOzon.Видимость									= Истина;
		Элементы.ДанныеИзМаркетплейсаЦенаПродавцаСУчетомСкидки.Видимость	= Истина;
		
		Элементы.ДанныеИзМаркетплейсаТипДокумента.Видимость					= Ложь;
		Элементы.ДанныеИзМаркетплейсаАртикул.Видимость						= Ложь;
		Элементы.ДанныеИзМаркетплейсаБаракод.Видимость						= Ложь;
		Элементы.ДанныеИзМаркетплейсаОбоснованиеДляОплаты.Видимость 		= Ложь;
		Элементы.ДанныеИзМаркетплейсаНомерПоставки.Видимость 				= Ложь;
		Элементы.ДанныеИзМаркетплейсаВознаграждениеБезНДС.Видимость 		= Ложь;
		Элементы.ДанныеИзМаркетплейсаНДССВознаграждения.Видимость			= Ложь;
		Элементы.ДанныеИзМаркетплейсаНомерЗаказа.Видимость					= Ложь;
		Элементы.ДанныеИзМаркетплейсаЦенаЗаШтукуБезУчетаСкидок.Видимость 	= Ложь;
		Элементы.ДанныеИзМаркетплейсаЦенаЗаШтукуСУчетомСкидок.Видимость 	= Ложь;
		Элементы.ДанныеИзМаркетплейсаЦенаСуммаБезУчетаСкидок.Видимость 		= Ложь;
		Элементы.ДанныеИзМаркетплейсаЦенаСуммаСУчетомСкидок.Видимость 		= Ложь;
		Элементы.ДанныеИзМаркетплейсаЦена.Видимость							= Ложь;
		Элементы.ДанныеИзМаркетплейсаСумма.Видимость						= Ложь;
		Элементы.ДанныеИзМаркетплейсаПродано.Видимость						= Ложь;
		Элементы.ДанныеИзМаркетплейсаВознаграждение.Видимость				= Ложь;
		
		НачалоПериода 	= Дата(1,1,1);
		КонецПериода 	= Дата(1,1,1);
		
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
		
		Элементы.ПредставлениеМесяцГод.Видимость 	= Истина;
		Элементы.ГруппаСклад.Видимость				= Истина;
		
		Элементы.УстановитьИнтервал.Видимость	= Ложь;
		Элементы.НачалоПериода.Видимость 		= Ложь;
		Элементы.КонецПериода.Видимость 		= Ложь;
		
		Элементы.ДанныеИзМаркетплейсаSKU.Видимость							= Истина;
		Элементы.ДанныеИзМаркетплейсаНомерЗаказа.Видимость					= Истина;
		Элементы.ДанныеИзМаркетплейсаЦенаЗаШтукуБезУчетаСкидок.Видимость 	= Истина;
		Элементы.ДанныеИзМаркетплейсаЦенаЗаШтукуСУчетомСкидок.Видимость 	= Истина;
		Элементы.ДанныеИзМаркетплейсаЦенаСуммаБезУчетаСкидок.Видимость 		= Истина;
		Элементы.ДанныеИзМаркетплейсаЦенаСуммаСУчетомСкидок.Видимость 		= Истина;
		Элементы.ДанныеИзМаркетплейсаПродано.Видимость						= Истина;
		Элементы.ДанныеИзМаркетплейсаТипДокумента.Видимость					= Истина;
		
		Элементы.ДанныеИзМаркетплейсаВознаграждение.Видимость				= Ложь;
		Элементы.ДанныеИзМаркетплейсаАртикул.Видимость						= Ложь;
		Элементы.ДанныеИзМаркетплейсаБаракод.Видимость						= Ложь;
		Элементы.ДанныеИзМаркетплейсаОбоснованиеДляОплаты.Видимость 		= Ложь;
		Элементы.ДанныеИзМаркетплейсаВознаграждениеБезНДС.Видимость 		= Ложь;
		Элементы.ДанныеИзМаркетплейсаНДССВознаграждения.Видимость			= Ложь;
		Элементы.ДанныеИзМаркетплейсаНомерПоставки.Видимость 				= Ложь;
		Элементы.ДанныеИзМаркетплейсаЦена.Видимость							= Ложь;
		Элементы.ДанныеИзМаркетплейсаСумма.Видимость						= Ложь;
		Элементы.ДанныеИзМаркетплейсаЦенаПродавцаСУчетомСкидки.Видимость	= Ложь;
		Элементы.ГруппаРеализованоOzon.Видимость							= Ложь;
		Элементы.ГруппаВозвращеноOzon.Видимость								= Ложь;
		Элементы.ГруппаОтправлениеOzon.Видимость							= Ложь;
		Элементы.ГруппаСчетФактура.Видимость								= Ложь;
		Элементы.ГруппаИтогиOzon.Видимость									= Ложь;
		
		НачалоПериода 	= Дата(1,1,1);
		КонецПериода 	= Дата(1,1,1);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкладНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АккаунтМаркетплейса", АккаунтМаркетплейса); 
	ОткрытьФорму("ОбщаяФорма.рар_мп_ФормаВыбораСопоставленныхСкладов", ПараметрыФормы, Элементы.Склад);
	
КонецПроцедуры

&НаКлиенте
Процедура СкладОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Склад = ВыбранноеЗначение.Склад;
	campaignID = ВыбранноеЗначение.campaignID;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеМесяцГодНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериодаМесяц",, Элементы.ПредставлениеМесяцГод);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеМесяцГодОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ПроверитьДату_Ozon_ЯндексМаркет(ВыбранноеЗначение.НачалоПериода) Тогда
		Возврат;
	КонецЕсли;
	
	МесяцГод = ВыбранноеЗначение.НачалоПериода;
	
	ПредставлениеМесяцГод = Формат(МесяцГод, "ДФ='MMMM yyyy'");
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцГодПриИзменении(Элемент)
	
	ПредставлениеМесяцГод = Формат(МесяцГод, "ДФ='MMMM yyyy'");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьИнтервал(Команда)
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Период = Новый СтандартныйПериод();
	Период.ДатаНачала 		= НачалоПериода;
	Период.ДатаОкончания 	= КонецПериода;
	Диалог.Период = Период;
	
	Диалог.Показать(Новый ОписаниеОповещения("УстановитьПериод",ЭтаФорма));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериод(ЗначениеПериода, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеПериода <> Неопределено Тогда
		НачалоПериода = ЗначениеПериода.ДатаНачала;
		КонецПериода = ЗначениеПериода.ДатаОкончания;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	Период.ДатаНачала = НачалоПериода;
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	Период.ДатаОкончания = КонецПериода;
КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаДанных

&НаКлиенте
Процедура ЗагрузитьДанные(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		
		Если Не ДатаЗаполнена() Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Заполните период";
			Сообщение.Сообщить();
			
			Возврат;
		КонецЕсли;
		
		Если Не СкладЗаполнен() Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Заполните склад";
			Сообщение.Сообщить();
			
			Возврат;
		КонецЕсли;
		
		ДанныеИзМаркетплейса.Очистить();
		
		ТекстСообщения = ПолучитьТекстСообщения(АккаунтМаркетплейса);
		
		ДлительнаяОперация = СформироватьТаблицуНаСервере();
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьСообщения = Истина;
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ПараметрыОжидания.ТекстСообщения = ТекстСообщения;
		Оповещение = Новый ОписаниеОповещения("ЗавершениеЗагрузки", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СформироватьТаблицуНаСервере()
	
	Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АккаунтМаркетплейса, "Маркетплейс");
	
	Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор); 
			
		ВозвратныеДанные = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
				"рар_мп_ОтчетКомиссионера.ПолучитьОтчетКомиссионера_Wildberries", АккаунтМаркетплейса, НачалоПериода, КонецПериода);
		
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON Тогда
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор); 
			
		ВозвратныеДанные = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
				"рар_мп_ОтчетКомиссионера.ПолучитьОтчетКомиссионера_Ozon", АккаунтМаркетплейса, МесяцГод);
		
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор); 
			
		ВозвратныеДанные = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
				"рар_мп_ОтчетКомиссионера.ПолучитьОтчетКомиссионера_ЯндексМаркет", АккаунтМаркетплейса, МесяцГод, campaignID);
		
	КонецЕсли;
			
	Возврат ВозвратныеДанные;
		
КонецФункции

&НаКлиенте
Процедура ЗавершениеЗагрузки(Результат, СтруктураПараметров) Экспорт
	
	Если Результат = НЕОПРЕДЕЛЕНО Тогда
	
		Возврат;	
	
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
	
		ЗавершениеЗагрузкиНаСервере(Результат);
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		
		ЗавершениеЗагрузкиОшибкаНаСервере();

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗавершениеЗагрузкиНаСервере(Результат)
	
	ТЗ = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	
	Попытка
		
		ДанныеИзМаркетплейса.Загрузить(ТЗ);
		ОбщегоНазначения.СообщитьПользователю("Загрузка завершена");
		
		Если ДанныеИзМаркетплейса.Количество() = 0 Тогда
			ОбщегоНазначения.СообщитьПользователю("Для данного аккаунта нет данных о продажах по реализации");
		Иначе
			
			Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АккаунтМаркетплейса, "Маркетплейс");
			
			Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON Тогда
				
				ВсегоВыплатыОтПартнеров 	= ДанныеИзМаркетплейса.Итог("ВыплатыОтПартнеров") - ДанныеИзМаркетплейса.Итог("ВозвратыВыплатыОтПартнеров");
				ВсегоКНачислению 			= ДанныеИзМаркетплейса.Итог("ИтогиКНачислению") - ДанныеИзМаркетплейса.Итог("ИтогоВозвращено");
				ВсегоНачисленоБаллов 		= ДанныеИзМаркетплейса.Итог("ДоплатаЗаСчетOzon") - ДанныеИзМаркетплейса.Итог("ВозвратДоплатаЗаСчетOzon");
				ВсегоБазоваяКомиссия 		= ДанныеИзМаркетплейса.Итог("ИтогиКомиссияСУчетомСкидокИНаценок") - ДанныеИзМаркетплейса.Итог("ВозвратИтогиКомиссияСУчетомСкидокИНаценок");
				ВсегоКомиссияПослеСкидок 	= ВсегоБазоваяКомиссия - ВсегоНачисленоБаллов;
				
				Если ВсегоКомиссияПослеСкидок < ВсегоБазоваяКомиссия / 100 Тогда
					ВсегоКомиссияПослеСкидок = ВсегоБазоваяКомиссия / 100;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли
	
	Исключение
		
		ОбщегоНазначения.СообщитьПользователю("Ошибка при загрузке данных из маркетплейса. Подробное описание ошибки можно посмотреть в журнале регистрации");
		
		ЗаписьЖурналаРегистрации("Ошибка при загрузке данных из маркетплейса в табличную часть", 
									УровеньЖурналаРегистрации.Ошибка,,, СтрШаблон("Аккаунт: %1. Описание ошибки: %2", АккаунтМаркетплейса.Наименование, ОписаниеОшибки()));
		
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ЗавершениеЗагрузкиОшибкаНаСервере()
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Ошибка при загрузке данных. Подробное описание можно посмотреть в журнале регистрации";
	Сообщение.Сообщить();
	
	ЗаписьЖурналаРегистрации("Ошибка при загрузке данных", 
								УровеньЖурналаРегистрации.Ошибка,,, СтрШаблон("Аккаунт: %1. Описание ошибки: %2", АккаунтМаркетплейса.Наименование, ОписаниеОшибки()));
	
КонецПроцедуры

#КонецОбласти

#Область СозданиеОтчетаКомиссионера

&НаСервере
Процедура СоздатьОтчетКомиссионераНаСервере()
	
	Если Не ЗначениеЗаполнено(ОтчетКомиссионера) Тогда
		
		Если ДанныеИзМаркетплейса.Количество() = 0 Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Таблица пустая";
			Сообщение.Сообщить();
			
			Возврат;
			
		КонецЕсли;
		
		Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АккаунтМаркетплейса, "Маркетплейс");
		
		Если Не ПроверитьНоменклатуру(Маркетплейс) Тогда
			Возврат;
		КонецЕсли;
		
		Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
			ОтчетКомиссионера = рар_мп_ОтчетКомиссионера.СоздатьОтчетКомиссионера_Wildberries(Период, ДанныеИзМаркетплейса, АккаунтМаркетплейса);
		ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON Тогда
			ОтчетКомиссионера = рар_мп_ОтчетКомиссионера.СоздатьОтчетКомиссионера_Ozon(МесяцГод, ДанныеИзМаркетплейса, АккаунтМаркетплейса, ВсегоКомиссияПослеСкидок);
		ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
			ОтчетКомиссионера = рар_мп_ОтчетКомиссионера.СоздатьОтчетКомиссионера_ЯндексМаркет(МесяцГод, ДанныеИзМаркетплейса, АккаунтМаркетплейса);
		КонецЕсли;
		
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Отчет комиссионера уже создан";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОтчетКомиссионера(Команда)
	СоздатьОтчетКомиссионераНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьТекстСообщения(АккаунтМаркетплейса)
	
	Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АккаунтМаркетплейса, "Маркетплейс");
	
	Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
		ТекстСообщения = СтрШаблон("Получение отчета комиссионера с %1 по %2", Формат(НачалоПериода, "ДФ=гггг-ММ-дд"), Формат(КонецПериода, "ДФ=гггг-ММ-дд"));
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON Тогда
		ТекстСообщения = СтрШаблон("Получение отчета комиссионера за %1", Формат(МесяцГод, "ДФ='MMMM yyyy'"));
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда	
		ТекстСообщения = СтрШаблон("Получение отчета комиссионера за %1", Формат(МесяцГод, "ДФ='MMMM yyyy'"));
	КонецЕсли;
		
	Возврат ТекстСообщения;
	
КонецФункции

&НаСервере
Функция ДатаЗаполнена()
	
	Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АккаунтМаркетплейса, "Маркетплейс");
	
	Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
		Если Не ЗначениеЗаполнено(НачалоПериода) Или Не ЗначениеЗаполнено(КонецПериода) Тогда
			Возврат Ложь;
		КонецЕсли;
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON Тогда
		Если Не ЗначениеЗаполнено(МесяцГод) Тогда
			Возврат Ложь;
		КонецЕсли;
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда	
		Если Не ЗначениеЗаполнено(МесяцГод) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция СкладЗаполнен()
	
	Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АккаунтМаркетплейса, "Маркетплейс");
	
	Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда	
		Если Не ЗначениеЗаполнено(Склад) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ПроверитьНоменклатуру(Маркетплейс)
	
	ОтсутствуетНоменклатура = Ложь;
	
	Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
		
		Для Каждого Строка Из ДанныеИзМаркетплейса Цикл
			
			Если ЗначениеЗаполнено(Строка.Баракод) И Не ЗначениеЗаполнено(Строка.Номенклатура) Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Отсутствует номенклатура с баракодом: %1 в сопоставленных товарах (строка №%2)", Строка.Баракод, Строка.НомерСтроки);
				Сообщение.Сообщить();
				
				ОтсутствуетНоменклатура = Истина;
				
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON Тогда
		
		Для Каждого Строка Из ДанныеИзМаркетплейса Цикл
			
			Если ЗначениеЗаполнено(Строка.SKU) И Не ЗначениеЗаполнено(Строка.Номенклатура) Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Отсутствует номенклатура с id: %1 в сопоставленных товарах (строка №%2)", Строка.SKU, Строка.НомерСтроки);
				Сообщение.Сообщить();
				
				ОтсутствуетНоменклатура = Истина;
				
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда	
		
		Для Каждого Строка Из ДанныеИзМаркетплейса Цикл
			
			Если ЗначениеЗаполнено(Строка.SKU) И Не ЗначениеЗаполнено(Строка.Номенклатура) Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Отсутствует номенклатура с id: %1 в сопоставленных товарах (строка №%2)", Строка.SKU, Строка.НомерСтроки);
				Сообщение.Сообщить();
				
				ОтсутствуетНоменклатура = Истина;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ОтсутствуетНоменклатура Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось создать отчет комиссионера, так как в таблице отсутствует сопоставленная номенклатура";
		Сообщение.Сообщить();
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ПроверитьДату_Ozon_ЯндексМаркет(ВыбраннаяДата)
	
	Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АккаунтМаркетплейса, "Маркетплейс");
	
	Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON Или Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
		
		ТекущаяДата = ТекущаяДата();
		ТекущийМесяц = Месяц(ТекущаяДата);
		ТекущийГод = Год(ТекущаяДата);
		ТекущийДень = День(ТекущаяДата);
		
		ВыбранныйМесяц = Месяц(ВыбраннаяДата);
		ВыбранныйГод = Год(ВыбраннаяДата);
		
		ДатаТекущегоМесяца = Дата(ТекущийГод, ТекущийМесяц, 1);
		ДатаВыбора = Дата(ВыбранныйГод, ВыбранныйМесяц, 1);
		
		Если ДатаВыбора >= ДатаТекущегоМесяца Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Нельзя выбрать текущий период, так как отчет можно сформировать не поздее 5 числа следующего месяца";
			Сообщение.Сообщить();
			Возврат Ложь;
		КонецЕсли;
		
		Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON Тогда
			
			ДатаПредыдущегоМесяца = НачалоМесяца(ДобавитьМесяц(ДатаТекущегоМесяца, -1));
			
			Если НачалоМесяца(ВыбраннаяДата) = ДатаПредыдущегоМесяца Тогда
				Если ТекущийДень < 5 Тогда
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Нельзя выбрать текущий период, так как отчет можно сформировать не поздее 5 числа следующего месяца";
					Сообщение.Сообщить();
					Возврат Ложь;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти
